export interface FAQItem {
  id: number;
  question: string;
  answer: string;
}

export const FAQData: Record<"home" | "trade" | "account"| "ticket", FAQItem[]> = {
  home: [
    {
      id: 1,
      question: "چگونه در پی‌فا24  ثبت نام کنم؟",
      answer: "برای ثبت نام در پی فا 24  کافی است به صفحه ثبت نام رفته و اطلاعات شخصی خود را وارد کنید  پس از تایید ایمیل و شماره تماس  حساب کاربری شما فعال میشود"
    },
    {
      id: 2,
      question: "مدارک لازم برای احراز هویت چیست؟",
      answer: "برای احراز هویت در پی فا 24، تصویر کارت ملی، شماره شبا بانکی و یک عکس سلفی به همراه کارت ملی خود را باید آپلود کنید. این مدارک برای تایید هویت و جلوگیری از تقلب و پول‌شویی الزامی است."
    },
    {
      id: 3,
      question: "کارمزد معاملات در پی فا 24 چقدر است؟",
      answer: "کارمزد معاملات در پی فا 24 بر اساس حجم معاملات شما متفاوت است. برای اطلاعات بیشتر در مورد ساختار کارمزد، به صفحه کارمزدها مراجعه کنید."
    },
    {
      id: 4,
      question: "چگونه امنیت حساب کاربری خود را افزایش بدهم؟",
      answer: "برای افزایش امنیت حساب کاربری خود، توصیه می‌کنیم از تایید دو مرحله‌ای (2FA) استفاده کنید. همچنین رمز عبور قوی انتخاب کرده و هرگز آن را با کسی به اشتراک نگذارید."
    },
    {
      id: 5,
      question: "آیا پی فا 24 سقف برداشت روزانه دارد؟",
      answer: "بله، سقف برداشت روزانه بر اساس سطح احراز هویت شما تعیین می‌شود. برای افزایش سقف برداشت، می‌توانید مدارک بیشتری ارائه دهید."
    },
  ],

  trade: [
    {
      id: 6,
      question: "چگونه در پی‌فا24 ارز دیجیتال بفروشیم؟",
      answer: "برای فروش ارز دیجیتال در صرافی پی‌فا24، ابتدا باید هویت خود را تایید کنید. سپس به بخش خرید و فروش رفته، ارز مورد نظر را انتخاب کرده و مقدار آن را وارد کنید. در نهایت با کلیک بر روی گزینه فروش، تراکنش خود را تکمیل کنید."
    },
    {
      id: 7,
      question: "حداقل مبلغ خرید و فروش چقدر است؟",
      answer: "حداقل مبلغ خرید و فروش در پی فا 24 بسته به نوع ارز متفاوت است. برای اطلاع از حداقل مبلغ، به صفحه جزئیات هر ارز مراجعه کنید."
    },
    {
      id: 8,
      question: "آیا امکان بازگشت تراکنش‌ها وجود دارد؟",
      answer: "خیر، تراکنش‌های ارز دیجیتال غیرقابل بازگشت هستند. لطفاً قبل از تایید تراکنش، تمامی جزئیات را به دقت بررسی کنید."
    },
    {
      id: 9,
      question: "آیا میتوان جزئیات سفارش انجام شده را مشاهده کنم؟",
      answer: "بله , تمامی سفارش‌های انجام شده را میتوانید در قسمت تاریخچه تراکنش‌های حساب کاربری شما ثبت میشود و در هر لحظه میتوانید مشاهده کنید."
    },
    {
      id: 10,
      question: "اگر خرید انجام نشد و با خطا مواجه شد , باید چه کنم؟",
      answer: "در صورت مواجهه با خطا ابتدا اتصال اینترنت خود را بررسی کنید در صورتی که همچنان مشکل داشت با پشتیبانی پی‌فا24 تماس بگیرید تا بررسی شود."
    },
  ],

  account: [
    {
      id: 11,
      question: "چگونه در پی‌فا24  ثبت نام کنم؟",
      answer:
        "برای ثبت نام در پی فا 24  کافی است به صفحه ثبت نام رفته و اطلاعات شخصی خود را وارد کنید  پس از تایید ایمیل و شماره تماس  حساب کاربری شما فعال میشود"
    },
    {
      id: 12,
      question: "مدارک لازم برای احراز هویت چیست؟",
      answer: "برای احراز هویت در پی فا 24، تصویر کارت ملی، شماره شبا بانکی و یک عکس سلفی به همراه کارت ملی خود را باید آپلود کنید. این مدارک برای تایید هویت و جلوگیری از تقلب و پول‌شویی الزامی است."
    },
    {
      id: 13,
      question: "کارمزد معاملات در پی فا 24 چقدر است؟",
      answer: "کارمزد معاملات در پی فا 24 بر اساس حجم معاملات شما متفاوت است. برای اطلاعات بیشتر در مورد ساختار کارمزد، به صفحه کارمزدها مراجعه کنید."
    },
    {
      id: 14,
      question: "چگونه امنیت حساب کاربری خود را افزایش بدهم؟",
      answer: "برای افزایش امنیت حساب کاربری خود، توصیه می‌کنیم از تایید دو مرحله‌ای (2FA) استفاده کنید. همچنین رمز عبور قوی انتخاب کرده و هرگز آن را با کسی به اشتراک نگذارید."
    },
    {
      id: 15,
      question: "آیا پی فا 24 سقف برداشت روزانه دارد؟",
      answer: "در صورت مواجهه با خطا ابتدا اتصال اینترنت خود را بررسی کنید در صورتی که همچنان مشکل داشت با پشتیبانی پی‌فا24 تماس بگیرید تا بررسی شود."
    },
    {
      id: 16,
      question: "ایا میتوانم از کارت بانکی دیگری استفاده کنم؟",
      answer: "خیر، برای جلوگیری از تقلب، تنها می‌توانید از کارت بانکی که به نام شما ثبت شده است برای واریز و برداشت استفاده کنید."
    },
    {
      id: 17,
      question: "حداقل مبلغ خرید و فروش چقدر است؟",
      answer: "حداقل مبلغ خرید و فروش در پی فا 24 بسته به نوع ارز متفاوت است. برای اطلاع از حداقل مبلغ، به صفحه جزئیات هر ارز مراجعه کنید."
    },
     {
      id: 18,
      question: "آیا امکان بازگشت تراکنش‌ها وجود دارد؟",
      answer: "خیر، تراکنش‌های ارز دیجیتال غیرقابل بازگشت هستند. لطفاً قبل از تایید تراکنش، تمامی جزئیات را به دقت بررسی کنید."
    },
    {
      id: 19,
      question: "آیا میتوان جزئیات سفارش انجام شده را مشاهده کنم؟",
      answer: "بله , تمامی سفارش‌های انجام شده را میتوانید در قسمت تاریخچه تراکنش‌های حساب کاربری شما ثبت میشود و در هر لحظه میتوانید مشاهده کنید."
    },
    {
      id: 20,
      question: "اگر خرید انجام نشد و با خطا مواجه شد , باید چه کنم؟",
      answer: "در صورت مواجهه با خطا ابتدا اتصال اینترنت خود را بررسی کنید در صورتی که همچنان مشکل داشت با پشتیبانی پی‌فا24 تماس بگیرید تا بررسی شود."
    }
  ],
  ticket: [
    {
      id: 1,
      question: "چگونه در پی‌فا24  ثبت نام کنم؟",
      answer: "برای ثبت نام در پی فا 24  کافی است به صفحه ثبت نام رفته و اطلاعات شخصی خود را وارد کنید  پس از تایید ایمیل و شماره تماس  حساب کاربری شما فعال میشود"
    },
    {
      id: 2,
      question: "مدارک لازم برای احراز هویت چیست؟",
      answer: "برای احراز هویت در پی فا 24، تصویر کارت ملی، شماره شبا بانکی و یک عکس سلفی به همراه کارت ملی خود را باید آپلود کنید. این مدارک برای تایید هویت و جلوگیری از تقلب و پول‌شویی الزامی است."
    },
    {
      id: 3,
      question: "کارمزد معاملات در پی فا 24 چقدر است؟",
      answer: "کارمزد معاملات در پی فا 24 بر اساس حجم معاملات شما متفاوت است. برای اطلاعات بیشتر در مورد ساختار کارمزد، به صفحه کارمزدها مراجعه کنید."
    },
    {
      id: 4,
      question: "چگونه امنیت حساب کاربری خود را افزایش بدهم؟",
      answer: "برای افزایش امنیت حساب کاربری خود، توصیه می‌کنیم از تایید دو مرحله‌ای (2FA) استفاده کنید. همچنین رمز عبور قوی انتخاب کرده و هرگز آن را با کسی به اشتراک نگذارید."
    },
    {
      id: 5,
      question: "آیا پی فا 24 سقف برداشت روزانه دارد؟",
      answer: "بله، سقف برداشت روزانه بر اساس سطح احراز هویت شما تعیین می‌شود. برای افزایش سقف برداشت، می‌توانید مدارک بیشتری ارائه دهید."
    },
    {
      id: 6,
      question: "چگونه در پی‌فا24 ارز دیجیتال بفروشیم؟",
      answer: "برای فروش ارز دیجیتال در صرافی پی‌فا24، ابتدا باید هویت خود را تایید کنید. سپس به بخش خرید و فروش رفته، ارز مورد نظر را انتخاب کرده و مقدار آن را وارد کنید. در نهایت با کلیک بر روی گزینه فروش، تراکنش خود را تکمیل کنید."
    }
  
  ]

};
